Documents/ЗаявкаНаВключениеВПланОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВключениеВПланОбучения</Name>
			<BasedOn>
				<xr:Item>Catalog.МероприятияОбученияРазвития</xr:Item>
				<xr:Item>Document.ЗаявкаНаОбучениеРазвитие</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьМероприятия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаСуммыРасходовНаПерсонал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКомпетенции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КомпетенцииПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаВключениеВПланОбучения/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	РежимВыбора = Параметры.РежимВыбора;
	
	Если Параметры.Свойство("СписокУжеПодобранныхЗаявок") Тогда
		Подобранные.ЗагрузитьЗначения(ПолучитьИзВременногоХранилища(Параметры.СписокУжеПодобранныхЗаявок));
	КонецЕсли;
	
	Если Параметры.Свойство("РегистраторИсключение") Тогда
		РегистраторИсключение = Параметры.РегистраторИсключение;
		Список.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("РегистраторИсключение", РегистраторИсключение);
	КонецЕсли;
	
	ЕстьПраваНаЧтениеПлана = ПравоДоступа("Чтение", Метаданные.Документы.ПланОбученияРазвития);
	
	УстановитьЗначенияОтборов();
	
	// Определяем уровень пользователя.
	ОбучениеРазвитие.УстановитьРеквизитыДоступностиРолей(ЭтотОбъект);
	ОбучениеРазвитие.СкрытьНеРазрешенныеКомандыПоРолям(ЭтотОбъект);
	
	УстановитьОбязательноеИспользованиеПолейДинамическогоСписка();
	
	УстановитьОтборыДинамическогоСписка();
	// Инициируем список отборов.
	УстановитьСоставСпискаОтборов();
	УстановитьТекущееЗначениеСпискаОтборов();
	УстановитьСвойстваЭлементовФормы(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КоманднаяПанельФормы;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список");
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом 
	
	ОбучениеРазвитиеФормы.УстановитьВидимостьКомандСогласованияЗаявок(ЭтотОбъект, РежимВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Элементы.Список.РежимВыбора Или Не Элементы.Список.МножественныйВыбор Тогда
		Возврат;
	КонецЕсли;
	
	Если ВсеВыбранные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	НачатьВопросОВыбореПодобранных();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокОтборовПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Статус");
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ВключенаВПлан");
	
	Если СписокОтборов = "НеПодготовленные" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Статус",
			ПредопределенноеЗначение("Перечисление.СостоянияСогласования.ПустаяСсылка"),
			ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ИначеЕсли СписокОтборов = "НеУтвержденные" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Статус",
			ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Рассматривается"),
			ВидСравненияКомпоновкиДанных.Равно,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"ВключенаВПлан",
			Ложь,
			ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтборовОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Возврат;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не Элементы.Список.РежимВыбора Тогда
		Возврат;
	КонецЕсли;

	Если Не Элементы.Список.МножественныйВыбор Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ОбновитьПодобранные(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если Не Элементы.Список.РежимВыбора Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Элементы.Список.МножественныйВыбор Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Если Значение.Количество() > 1 Или ВсеВыбранные.Количество() = 0 Тогда
		ОбновитьПодобранные(Значение);
	КонецЕсли;

	ВыполнитьВыбор();
	ВсеВыбранные.Очистить();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	ОбучениеРазвитиеФормы.ЗаполнитьДинамическиеСтатусыЗаявокНаВключениеВПланОбучения(Настройки, Строки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВернутьНаПодготовку(Команда)
	ВыполнитьКомандуНаКлиенте(Команда, ПредопределенноеЗначение("Перечисление.СостоянияСогласования.ПустаяСсылка"));
КонецПроцедуры

&НаКлиенте
Процедура НаправитьНаСогласование(Команда)
	ВыполнитьКомандуНаКлиенте(Команда, ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Рассматривается"));
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ВыполнитьКомандуНаКлиенте(Команда, ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Отклонено"));
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтклонение(Команда)
	ВыполнитьКомандуНаКлиенте(Команда, ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Рассматривается"));
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
			Команда,
			ЭтотОбъект,
			Элементы.Список);
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УстановкаСвойствЭлементовФормы

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваЭлементовФормы(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СписокОтборов",
		"Видимость",
		НЕ Форма.РежимВыбора);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ФормаНаправитьНаСогласование",
		"Видимость",
		НЕ Форма.РежимВыбора);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ФормаВернутьНаПодготовку",
		"Видимость",
		НЕ Форма.РежимВыбора);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Список",
		"РежимВыбора",
		Форма.РежимВыбора);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Список",
		"МножественныйВыбор",
		Форма.РежимВыбора);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Список",
		"ИзменятьСоставСтрок",
		НЕ Форма.РежимВыбора);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Список",
		"ИзменятьПорядокСтрок",
		НЕ Форма.РежимВыбора);
		
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьОбязательноеИспользованиеПолейДинамическогоСписка()

	Если Не ЕстьПраваНаЧтениеПлана Тогда
		Возврат;
	КонецЕсли;
	
	Список.УстановитьОбязательноеИспользование("ВключенаВПлан", Истина);

КонецПроцедуры

&НаСервере
Процедура УстановитьСоставСпискаОтборов()

	Элементы.СписокОтборов.СписокВыбора.Добавить("Все","Все");
	Если ДоступноСогласованиеПервогоУровня Тогда
		Элементы.СписокОтборов.СписокВыбора.Добавить("НеПодготовленные", НСтр("ru = 'Не подготовленные'"));
	КонецЕсли;
	Если ДоступноСогласованиеВторогоУровня Тогда
		Элементы.СписокОтборов.СписокВыбора.Добавить("НеУтвержденные", НСтр("ru = 'Не утвержденные'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущееЗначениеСпискаОтборов()

	Если ДоступноСогласованиеПервогоУровня И ДоступноСогласованиеВторогоУровня Тогда
		СписокОтборов = "Все";
	ИначеЕсли ДоступноСогласованиеПервогоУровня Тогда
		СписокОтборов = "НеПодготовленные";
	Иначе
		СписокОтборов = "НеУтвержденные";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияОтборов()

	Если Параметры.Свойство("ЗаявкаВыполнена") Тогда
		Если Параметры.ЗаявкаВыполнена Тогда
			ГруппаОтбораВыполнения = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
				Список.Отбор.Элементы,
				НСтр("ru = 'Только исполненные'"),
				ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		Иначе	
			ГруппаОтбораВыполнения = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
				Список.Отбор.Элементы,
				НСтр("ru = 'Только не исполненные'"),
				ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		КонецЕсли;	
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтбораВыполнения,
			"ВключенаВПлан",
			ВидСравненияКомпоновкиДанных.Равно,
			Параметры.ЗаявкаВыполнена,,Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоПроведенные") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Проведен",
			Параметры.ТолькоПроведенные,
			ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("Подразделение") И ЗначениеЗаполнено(Параметры.Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Подразделение",
			Параметры.Подразделение,
			ВидСравненияКомпоновкиДанных.ВИерархии,,Истина);
	КонецЕсли;
		
	Если (Параметры.Свойство("ДатаНачала") И ЗначениеЗаполнено(Параметры.ДатаНачала)) ИЛИ (Параметры.Свойство("ДатаОкончания") И ЗначениеЗаполнено(Параметры.ДатаОкончания)) Тогда
		
		ГруппаОтбораДаты = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			Список.Отбор.Элементы,
			НСтр("ru = 'Отбор по периоду заявок'"),
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
			
		Если Параметры.Свойство("ДатаНачала") И ЗначениеЗаполнено(Параметры.ДатаНачала) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
				ГруппаОтбораДаты,
				"ДатаНачала",
				ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
				Параметры.ДатаНачала,,Истина);
		КонецЕсли;
		Если Параметры.Свойство("ДатаОкончания") И ЗначениеЗаполнено(Параметры.ДатаОкончания) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
				ГруппаОтбораДаты,
				"ДатаНачала",
				ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
				Параметры.ДатаОкончания,,Истина);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыДинамическогоСписка()

	УстановитьРегистраторИсключение(ЭтотОбъект);
	УстановитьСписокПодобранныхЗаявок(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРегистраторИсключение(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Форма.Список,
		"РегистраторИсключение",
		Форма.РегистраторИсключение);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСписокПодобранныхЗаявок(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Форма.Список,
		"СписокУжеПодобранныхЗаявок",
		Форма.Подобранные.ВыгрузитьЗначения());
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуНаКлиенте(Команда, Статус)

	ОчиститьСообщения();
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	
	ЗаголовокКоманды = ЗаголовокКоманды(Команда.Имя);
	ПроверитьИЗаписатьМассивЗаявок(МассивСтрок, Команда.Имя, ЗаголовокКоманды, Статус);
		
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьИЗаписатьМассивЗаявок(МассивСтрок, Команда, ЗаголовокКоманды, Статус) 
	
	СписокСтатусов = СписокДоступныхСтатусовПоКоманде(Команда);
	
	Для каждого Заявка Из МассивСтрок Цикл
		ИнформацияПоЗаявке = ОбучениеРазвитие.СтатусЗаявкиНаВключениеВПлан(Заявка);
		Если ИнформацияПоЗаявке.ВключенаВПлан ИЛИ СписокСтатусов.НайтиПоЗначению(ИнформацияПоЗаявке.Статус) = Неопределено Тогда
			Если МассивСтрок.Количество() > 1 Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1:", Заявка) + " ";
			Иначе
				ТекстСообщения = "";
			КонецЕсли;
			Если ИнформацияПоЗаявке.ВключенаВПлан Тогда
				ТекстСообщения = ТекстСообщения + НСтр("ru = 'Заявки, включенные в план, не могут быть изменены'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ИначеЕсли СписокСтатусов.НайтиПоЗначению(ИнформацияПоЗаявке.Статус) = Неопределено Тогда
				ТекстСообщения = ТекстСообщения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Команда ""%1"" не применима к заявке со статусом ""%2""'"), ЗаголовокКоманды, ИнформацияПоЗаявке.СтатусНаименование);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		ОбучениеРазвитие.ЗаписатьЗаявкуНаСервере(Заявка.ПолучитьОбъект(), Статус);
	КонецЦикла; 
	
КонецПроцедуры

// Возвращает список доступных статусов по команде.
//
&НаСервереБезКонтекста
Функция СписокДоступныхСтатусовПоКоманде(Команда)

	СписокСтатусов = Новый СписокЗначений;
	
	Если Команда = "ВернутьНаПодготовку" Тогда
		СписокСтатусов.Добавить(Перечисления.СостоянияСогласования.Рассматривается);
	ИначеЕсли Команда = "НаправитьНаСогласование" Тогда
		СписокСтатусов.Добавить(Перечисления.СостоянияСогласования.ПустаяСсылка());
		СписокСтатусов.Добавить(Перечисления.СостоянияСогласования.Рассматривается);
		СписокСтатусов.Добавить(Перечисления.СостоянияСогласования.Отклонено);
	ИначеЕсли Команда = "Отклонить" Тогда
		СписокСтатусов.Добавить(Перечисления.СостоянияСогласования.Рассматривается);
	ИначеЕсли Команда = "ОтменитьОтклонение" Тогда
		СписокСтатусов.Добавить(Перечисления.СостоянияСогласования.Отклонено);
	КонецЕсли;

	Возврат СписокСтатусов;
	
КонецФункции

&НаСервере
Функция ЗаголовокКоманды(ИмяКоманды)

	ЭтаКоманда = Команды.Найти(ИмяКоманды);
	Если ЭтаКоманда = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат ЭтаКоманда.Заголовок;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПодобранные(Выбранные)
	
	Для Каждого Элемент Из Выбранные Цикл
		Если Не ЕстьВПодобранных(Элемент) Тогда
			Подобранные.Добавить(Элемент);
			ВсеВыбранные.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	УстановитьСписокПодобранныхЗаявок(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьВПодобранных(ЭтапСсылка)
	Возврат Подобранные.НайтиПоЗначению(ЭтапСсылка) <> Неопределено;
КонецФункции

&НаКлиенте
Процедура НачатьВопросОВыбореПодобранных()
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Подбор заявок на включение в план'");
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		Новый ОписаниеОповещения("ЗавершитьВопросОВыбореВыбранных", ЭтотОбъект), 
		НСтр("ru = 'Выбрать подобранные заявки?'"), 
		РежимДиалогаВопрос.ДаНетОтмена,
		ПараметрыВопроса);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВопросОВыбореВыбранных(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Или Ответ.Значение = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ.Значение = КодВозвратаДиалога.Да Тогда
		ВыполнитьВыбор();
	КонецЕсли;
	
	ВсеВыбранные.Очистить();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыбор()
	
	ДанныеВыбора = Новый Массив;
	Для Каждого Элемент Из ВсеВыбранные.ВыгрузитьЗначения() Цикл
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(Элемент);
		Описание = ОписаниеВыбранногоЭлемента();
		ЗаполнитьЗначенияСвойств(Описание, ДанныеСтроки);
		Описание.Заявка = ДанныеСтроки.Ссылка;
		ДанныеВыбора.Добавить(Описание);
	КонецЦикла;
	
	ОповеститьОВыборе(ДанныеВыбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеВыбранногоЭлемента()
	
	Описание = Новый Структура(
		"Заявка, 
		|Мероприятие, 
		|ДатаНачала, 
		|ДатаОкончания, 
		|Подразделение, 
		|КоличествоУчебныхЧасов, 
		|СуммаРасходов");
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти
